In [1]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python Docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the read-only "../input/" directory
# For example, running this (by clicking run or pressing Shift+Enter) will list all files under the input directory

import os
for dirname, _, filenames in os.walk('/kaggle/input'):
    for filename in filenames:
        print(os.path.join(dirname, filename))

# You can write up to 20GB to the current directory (/kaggle/working/) that gets preserved as output when you create a version using "Save & Run All" 
# You can also write temporary files to /kaggle/temp/, but they won't be saved outside of the current session

/kaggle/input/employee-performance-and-salary-dataset/50_Tasks_to_perform_on_dataset.pdf
/kaggle/input/employee-performance-and-salary-dataset/Employe_Performance_dataset.csv

In [2]:
#Load the dataset into a Pandas DataFrame and display the first 10 rows.
df = pd.read_csv('/kaggle/input/employee-performance-and-salary-dataset/Employe_Performance_dataset.csv') 
print(df.head(10))

   ID                Name  Age  Gender Department  Salary Joining Date  \
0   1        Cory Escobar   48  Female         HR    5641   2015-05-03
1   2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2   3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3   4  Christine Williams   58  Female         IT    5895   2017-09-08
4   5        Amber Harris   35   Other         IT    4317   2020-02-15
5   6         Ashley Howe   29  Female         HR    2591   2016-06-24
6   7         David Olson   39  Female      Sales    6826   2023-05-11
7   8        Amanda Baker   52   Other         HR    6285   2015-04-01
8   9       Jeremy Wright   63  Female      Sales    9862   2024-02-07
9  10      Brian Faulkner   30    Male         IT    8202   2018-05-26

   Performance Score  Experience    Status     Location  Session
0                2.0          16    Active     New York    Night
1                2.0          11  Inactive  Los Angeles  Evening
2                NaN           1  Inactive     New York  Morning
3                2.0          13  Inactive  Los Angeles  Evening
4                5.0          16  Inactive     New York  Evening
5                1.0           6    Active      Chicago  Evening
6                NaN           4    Active     New York    Night
7                NaN           8  Inactive      Chicago  Evening
8                NaN           3  Inactive     New York    Night
9                1.0           9    Active  Los Angeles  Morning

In [3]:
#What are the column names and their respective data types in the dataset?
print(df.dtypes)

ID                     int64
Name                  object
Age                    int64
Gender                object
Department            object
Salary                 int64
Joining Date          object
Performance Score    float64
Experience             int64
Status                object
Location              object
Session               object
dtype: object

In [4]:
# How many rows and columns are there in the dataset?
rows, columns = df.shape
print(f"The dataset has {rows} rows and {columns} columns.")

The dataset has 1000 rows and 12 columns.

In [5]:
#Select the Name, Age, and Salary columns using df[]. 
selected_columns = df[['Name', 'Age', 'Salary']]
print(selected_columns)

                   Name  Age  Salary
0          Cory Escobar   48    5641
1       Timothy Sanchez   25    4249
2          Chad Nichols   57    3058
3    Christine Williams   58    5895
4          Amber Harris   35    4317
..                  ...  ...     ...
995       Pamela Reeves   49    7652
996        Todd Johnson   29    6754
997     Michael Sanchez   18    5278
998       Ashley Taylor   51    5437
999         Shawn Scott   45    7364

[1000 rows x 3 columns]

In [6]:
# Select the first 5 rows of the DataFrame using the iloc method.
#one can use the loc method as well that includes a range or the .head() or slicing.
first_five_rows = df.iloc[:5]
print(first_five_rows)

   ID                Name  Age  Gender Department  Salary Joining Date  \
0   1        Cory Escobar   48  Female         HR    5641   2015-05-03
1   2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2   3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3   4  Christine Williams   58  Female         IT    5895   2017-09-08
4   5        Amber Harris   35   Other         IT    4317   2020-02-15

   Performance Score  Experience    Status     Location  Session
0                2.0          16    Active     New York    Night
1                2.0          11  Inactive  Los Angeles  Evening
2                NaN           1  Inactive     New York  Morning
3                2.0          13  Inactive  Los Angeles  Evening
4                5.0          16  Inactive     New York  Evening

In [7]:
# Select all rows where the Department is "Sales" using the loc method. 
#otherwise you can use Boolean Masking or query method.
sales_department = df.loc[df['Department'] == "Sales"]
print(sales_department)

      ID             Name  Age  Gender Department  Salary Joining Date  \
1      2  Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2      3     Chad Nichols   57   Other      Sales    3058   2019-02-12
6      7      David Olson   39  Female      Sales    6826   2023-05-11
8      9    Jeremy Wright   63  Female      Sales    9862   2024-02-07
10    11      Nicole Bell   42  Female      Sales    5336   2015-01-28
..   ...              ...  ...     ...        ...     ...          ...
991  992  William Schultz   23   Other      Sales    4311   2019-08-17
992  993   Ashley Daniels   25   Other      Sales    5524   2022-11-24
995  996    Pamela Reeves   49  Female      Sales    7652   2024-06-23
996  997     Todd Johnson   29  Female      Sales    6754   2018-07-20
997  998  Michael Sanchez   18    Male      Sales    5278   2023-07-05

     Performance Score  Experience    Status     Location  Session
1                  2.0          11  Inactive  Los Angeles  Evening
2                  NaN           1  Inactive     New York  Morning
6                  NaN           4    Active     New York    Night
8                  NaN           3  Inactive     New York    Night
10                 3.0           7    Active  Los Angeles  Evening
..                 ...         ...       ...          ...      ...
991                NaN          10  Inactive  Los Angeles  Evening
992                NaN           8  Inactive     New York  Morning
995                4.0           3    Active  Los Angeles  Evening
996                NaN          12  Inactive     New York  Morning
997                5.0           3    Active     New York  Morning

[338 rows x 12 columns]

In [8]:
#Select rows where the Salary is greater than 8000 and Status is "Active".

filtered_rows = df.loc[(df['Salary'] > 8000) & (df['Status'] == "Active")]
print(filtered_rows)

      ID             Name  Age  Gender Department  Salary Joining Date  \
9     10   Brian Faulkner   30    Male         IT    8202   2018-05-26
24    25    Tracy Carlson   21    Male         HR    9275   2022-04-09
38    39     Jordan Scott   33   Other      Sales    8678   2016-05-15
39    40      Lisa Wagner   36    Male         HR    8870   2024-08-12
60    61   Andrew Shannon   51   Other      Sales    8544   2020-02-08
..   ...              ...  ...     ...        ...     ...          ...
976  977    Kimberly Ross   19    Male      Sales    9331   2018-07-03
982  983    Stephen Ponce   46   Other      Sales    8696   2022-10-14
986  987  Melissa Bradley   39  Female         IT    9618   2015-07-05
988  989   Hannah Hickman   36  Female         IT    9118   2022-07-02
989  990    Shannon Meyer   18   Other         HR    9985   2022-11-05

     Performance Score  Experience  Status     Location  Session
9                  1.0           9  Active  Los Angeles  Morning
24                 4.0          12  Active     New York  Morning
38                 5.0           9  Active  Los Angeles  Evening
39                 4.0          17  Active  Los Angeles  Evening
60                 NaN           6  Active     New York  Evening
..                 ...         ...     ...          ...      ...
976                5.0          12  Active     New York  Morning
982                4.0           1  Active     New York  Evening
986                1.0          13  Active     New York  Morning
988                5.0           5  Active     New York    Night
989                4.0          18  Active      Chicago    Night

[112 rows x 12 columns]

In [9]:
#Extract the rows where the employee has been with the company for more than 5 years and has a 
#Performance Score of at least 4.
#if all employees started their experience journey at the company.
filter_rows=df.loc[(df['Experience']>5) &(df['Performance Score']>=4.0)]
print(filter_rows)

      ID                Name  Age  Gender Department  Salary Joining Date  \
4      5        Amber Harris   35   Other         IT    4317   2020-02-15
11    12   Rodney Richardson   60   Other         HR    6908   2015-03-14
17    18  Jacqueline Randall   31  Female         HR    3519   2018-05-18
18    19      Nancy Stephens   38    Male         HR    9061   2017-07-16
24    25       Tracy Carlson   21    Male         HR    9275   2022-04-09
..   ...                 ...  ...     ...        ...     ...          ...
978  979         Michael Lee   18  Female         IT    6086   2019-05-30
989  990       Shannon Meyer   18   Other         HR    9985   2022-11-05
990  991        Amy Johnston   53  Female         HR    3991   2024-09-03
993  994       Brandon Bruce   31  Female         HR    3371   2018-09-25
998  999       Ashley Taylor   51  Female         IT    5437   2022-02-18

     Performance Score  Experience    Status     Location  Session
4                  5.0          16  Inactive     New York  Evening
11                 4.0          19    Active      Chicago    Night
17                 4.0           6    Active     New York  Morning
18                 5.0          16  Inactive      Chicago    Night
24                 4.0          12    Active     New York  Morning
..                 ...         ...       ...          ...      ...
978                4.0           7  Inactive  Los Angeles  Evening
989                4.0          18    Active      Chicago    Night
990                4.0           8    Active      Chicago  Morning
993                5.0          12  Inactive      Chicago    Night
998                4.0           9  Inactive  Los Angeles  Evening

[137 rows x 12 columns]

In [10]:
#Calculate years of being with the company from the joining date till present.
df['Joining Date'] = pd.to_datetime(df['Joining Date'])

current_date = pd.Timestamp.now()
df['Years With Company'] = (current_date - df['Joining Date']).dt.days // 365

filtered_rows = df.loc[(df['Years With Company'] > 5) & (df['Performance Score'] >= 4)]

print(filtered_rows)

      ID                Name  Age  Gender Department  Salary Joining Date  \
11    12   Rodney Richardson   60   Other         HR    6908   2015-03-14
17    18  Jacqueline Randall   31  Female         HR    3519   2018-05-18
18    19      Nancy Stephens   38    Male         HR    9061   2017-07-16
22    23        Bryce Carter   35  Female      Sales    9598   2015-12-16
34    35            Lisa Fry   51  Female         IT    9259   2017-09-26
..   ...                 ...  ...     ...        ...     ...          ...
918  919     Tammy Schneider   22   Other         IT    3625   2016-10-24
937  938       Gary Mitchell   52  Female      Sales    9963   2016-09-22
972  973       James Mendoza   23   Other      Sales    6871   2016-04-11
976  977       Kimberly Ross   19    Male      Sales    9331   2018-07-03
993  994       Brandon Bruce   31  Female         HR    3371   2018-09-25

     Performance Score  Experience    Status     Location  Session  \
11                 4.0          19    Active      Chicago    Night
17                 4.0           6    Active     New York  Morning
18                 5.0          16  Inactive      Chicago    Night
22                 4.0           4  Inactive     New York    Night
34                 4.0          17  Inactive  Los Angeles    Night
..                 ...         ...       ...          ...      ...
918                4.0          14    Active      Chicago  Morning
937                5.0          20  Inactive  Los Angeles  Morning
972                4.0          15  Inactive     New York  Morning
976                5.0          12    Active     New York  Morning
993                5.0          12  Inactive      Chicago    Night

     Years With Company
11                    9
17                    6
18                    7
22                    9
34                    7
..                  ...
918                   8
937                   8
972                   8
976                   6
993                   6

[69 rows x 13 columns]

In [11]:
# Select every alternate row from the DataFrame using slicing with iloc. 
#starting from index 0, the sellecting every second row.
alternate=df.iloc[::2]
print(alternate)

      ID             Name  Age  Gender Department  Salary Joining Date  \
0      1     Cory Escobar   48  Female         HR    5641   2015-05-03
2      3     Chad Nichols   57   Other      Sales    3058   2019-02-12
4      5     Amber Harris   35   Other         IT    4317   2020-02-15
6      7      David Olson   39  Female      Sales    6826   2023-05-11
8      9    Jeremy Wright   63  Female      Sales    9862   2024-02-07
..   ...              ...  ...     ...        ...     ...          ...
990  991     Amy Johnston   53  Female         HR    3991   2024-09-03
992  993   Ashley Daniels   25   Other      Sales    5524   2022-11-24
994  995  Rachel Phillips   22    Male         IT    3096   2018-10-27
996  997     Todd Johnson   29  Female      Sales    6754   2018-07-20
998  999    Ashley Taylor   51  Female         IT    5437   2022-02-18

     Performance Score  Experience    Status     Location  Session  \
0                  2.0          16    Active     New York    Night
2                  NaN           1  Inactive     New York  Morning
4                  5.0          16  Inactive     New York  Evening
6                  NaN           4    Active     New York    Night
8                  NaN           3  Inactive     New York    Night
..                 ...         ...       ...          ...      ...
990                4.0           8    Active      Chicago  Morning
992                NaN           8  Inactive     New York  Morning
994                2.0           7  Inactive      Chicago  Evening
996                NaN          12  Inactive     New York  Morning
998                4.0           9  Inactive  Los Angeles  Evening

     Years With Company
0                     9
2                     5
4                     4
6                     1
8                     0
..                  ...
990                   0
992                   2
994                   6
996                   6
998                   2

[500 rows x 13 columns]

In [12]:
# Select every alternate row from the DataFrame using slicing with iloc. 
#starting from index 1 instead of index 0.
#can also be implemented for a specific range of alternates using df.iloc[1:99:2] (from index 1 to 99)
alternate_rows_from_second = df.iloc[1::2]
print(alternate_rows_from_second)

       ID                Name  Age  Gender Department  Salary Joining Date  \
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
5       6         Ashley Howe   29  Female         HR    2591   2016-06-24
7       8        Amanda Baker   52   Other         HR    6285   2015-04-01
9      10      Brian Faulkner   30    Male         IT    8202   2018-05-26
..    ...                 ...  ...     ...        ...     ...          ...
991   992     William Schultz   23   Other      Sales    4311   2019-08-17
993   994       Brandon Bruce   31  Female         HR    3371   2018-09-25
995   996       Pamela Reeves   49  Female      Sales    7652   2024-06-23
997   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
999  1000         Shawn Scott   45    Male         IT    7364   2022-07-31

     Performance Score  Experience    Status     Location  Session  \
1                  2.0          11  Inactive  Los Angeles  Evening
3                  2.0          13  Inactive  Los Angeles  Evening
5                  1.0           6    Active      Chicago  Evening
7                  NaN           8  Inactive      Chicago  Evening
9                  1.0           9    Active  Los Angeles  Morning
..                 ...         ...       ...          ...      ...
991                NaN          10  Inactive  Los Angeles  Evening
993                5.0          12  Inactive      Chicago    Night
995                4.0           3    Active  Los Angeles  Evening
997                5.0           3    Active     New York  Morning
999                2.0           4    Active     New York  Morning

     Years With Company
1                     4
3                     7
5                     8
7                     9
9                     6
..                  ...
991                   5
993                   6
995                   0
997                   1
999                   2

[500 rows x 13 columns]

In [13]:
# Retrieve rows where the employee belongs to "Sales" and has a Salary in the top 10% of all salaries.
top10perc_salary = df['Salary'].quantile(0.9)

high_paid_sales = df.loc[(df['Department'] == "Sales") & (df['Salary'] >= top10perc_salary)]

print(high_paid_sales)

      ID                     Name  Age  Gender Department  Salary  \
8      9            Jeremy Wright   63  Female      Sales    9862
22    23             Bryce Carter   35  Female      Sales    9598
29    30            Rachel Ramsey   22    Male      Sales    9661
215  216               Sara Jones   50  Female      Sales    9377
228  229          Christie Warren   51  Female      Sales    9139
239  240      Christina Gutierrez   37    Male      Sales    9356
250  251           Joshua Bullock   38    Male      Sales    9924
263  264          Gabriela Wilson   40   Other      Sales    9455
275  276          Harry Alexander   22    Male      Sales    9749
299  300              Terry Smith   38  Female      Sales    9375
379  380                Dustin Le   29    Male      Sales    9726
381  382           David Marshall   43   Other      Sales    9269
405  406            Heather Scott   57    Male      Sales    9505
442  443          Kimberly Sparks   26   Other      Sales    9146
491  492  Dr. Jacob Castaneda DVM   53   Other      Sales    9181
516  517           Christina Lowe   35  Female      Sales    9630
552  553          Amanda Griffith   26    Male      Sales    9704
591  592          Jonathan Rangel   49   Other      Sales    9323
594  595           Michelle Smith   35   Other      Sales    9906
629  630           Patricia Scott   52   Other      Sales    9364
742  743           Timothy Guzman   41  Female      Sales    9409
756  757              James James   38    Male      Sales    9666
758  759          Matthew Roberts   53    Male      Sales    9917
778  779             David Nelson   39   Other      Sales    9653
796  797            Jacob Shannon   35   Other      Sales    9926
844  845             Gerald Cooke   33   Other      Sales    9693
898  899           Tiffany Jordan   44    Male      Sales    9819
903  904             Leslie Mason   42   Other      Sales    9658
932  933             Kristin Cole   50    Male      Sales    9616
937  938            Gary Mitchell   52  Female      Sales    9963
976  977            Kimberly Ross   19    Male      Sales    9331

    Joining Date  Performance Score  Experience    Status     Location  \
8     2024-02-07                NaN           3  Inactive     New York
22    2015-12-16                4.0           4  Inactive     New York
29    2016-08-18                2.0          17  Inactive      Chicago
215   2019-10-16                NaN           3    Active  Los Angeles
228   2020-08-16                5.0           1    Active      Chicago
239   2018-01-02                3.0           3    Active      Chicago
250   2019-01-10                4.0          20  Inactive      Chicago
263   2023-11-19                1.0          14    Active  Los Angeles
275   2019-05-15                NaN           5    Active  Los Angeles
299   2022-12-23                NaN           2  Inactive     New York
379   2015-04-13                1.0           2  Inactive      Chicago
381   2018-10-05                2.0          13  Inactive  Los Angeles
405   2024-08-18                3.0           6  Inactive     New York
442   2024-07-29                3.0           3  Inactive     New York
491   2024-02-17                5.0           1  Inactive  Los Angeles
516   2018-07-03                NaN           1    Active  Los Angeles
552   2019-05-30                NaN           9    Active     New York
591   2021-01-19                NaN          18  Inactive      Chicago
594   2018-12-18                NaN           9    Active  Los Angeles
629   2019-11-05                NaN           5    Active     New York
742   2023-09-17                NaN          16  Inactive     New York
756   2016-04-14                NaN          15    Active  Los Angeles
758   2017-07-07                1.0          16    Active  Los Angeles
778   2021-08-08                NaN          19  Inactive     New York
796   2016-09-04                NaN           7    Active      Chicago
844   2017-08-29                NaN          17  Inactive     New York
898   2022-07-15                NaN          13    Active     New York
903   2019-10-31                1.0          14  Inactive     New York
932   2017-02-03                2.0          13  Inactive  Los Angeles
937   2016-09-22                5.0          20  Inactive  Los Angeles
976   2018-07-03                5.0          12    Active     New York

     Session  Years With Company
8      Night                   0
22     Night                   9
29     Night                   8
215  Morning                   5
228    Night                   4
239  Morning                   7
250    Night                   5
263  Morning                   1
275  Morning                   5
299  Morning                   2
379  Evening                   9
381  Evening                   6
405    Night                   0
442  Evening                   0
491  Morning                   0
516    Night                   6
552  Evening                   5
591  Evening                   3
594  Evening                   6
629  Evening                   5
742  Morning                   1
756  Morning                   8
758  Evening                   7
778  Morning                   3
796    Night                   8
844  Morning                   7
898  Morning                   2
903  Evening                   5
932    Night                   7
937  Morning                   8
976  Morning                   6

In [14]:
# Replace all "Inactive" values in the Status column with "Retired".
df['Status'] = df['Status'].replace('Inactive', 'Retired')

print(df)

       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
995   996       Pamela Reeves   49  Female      Sales    7652   2024-06-23
996   997        Todd Johnson   29  Female      Sales    6754   2018-07-20
997   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
998   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
999  1000         Shawn Scott   45    Male         IT    7364   2022-07-31

     Performance Score  Experience   Status     Location  Session  \
0                  2.0          16   Active     New York    Night
1                  2.0          11  Retired  Los Angeles  Evening
2                  NaN           1  Retired     New York  Morning
3                  2.0          13  Retired  Los Angeles  Evening
4                  5.0          16  Retired     New York  Evening
..                 ...         ...      ...          ...      ...
995                4.0           3   Active  Los Angeles  Evening
996                NaN          12  Retired     New York  Morning
997                5.0           3   Active     New York  Morning
998                4.0           9  Retired  Los Angeles  Evening
999                2.0           4   Active     New York  Morning

     Years With Company
0                     9
1                     4
2                     5
3                     7
4                     4
..                  ...
995                   0
996                   6
997                   1
998                   2
999                   2

[1000 rows x 13 columns]

In [15]:
#Add a new column Bonus where values are 10% of the Salary column.
df['Bonus'] = df['Salary'] * 0.10
print(df)

       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
995   996       Pamela Reeves   49  Female      Sales    7652   2024-06-23
996   997        Todd Johnson   29  Female      Sales    6754   2018-07-20
997   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
998   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
999  1000         Shawn Scott   45    Male         IT    7364   2022-07-31

     Performance Score  Experience   Status     Location  Session  \
0                  2.0          16   Active     New York    Night
1                  2.0          11  Retired  Los Angeles  Evening
2                  NaN           1  Retired     New York  Morning
3                  2.0          13  Retired  Los Angeles  Evening
4                  5.0          16  Retired     New York  Evening
..                 ...         ...      ...          ...      ...
995                4.0           3   Active  Los Angeles  Evening
996                NaN          12  Retired     New York  Morning
997                5.0           3   Active     New York  Morning
998                4.0           9  Retired  Los Angeles  Evening
999                2.0           4   Active     New York  Morning

     Years With Company  Bonus
0                     9  564.1
1                     4  424.9
2                     5  305.8
3                     7  589.5
4                     4  431.7
..                  ...    ...
995                   0  765.2
996                   6  675.4
997                   1  527.8
998                   2  543.7
999                   2  736.4

[1000 rows x 14 columns]

In [16]:
#Update the Performance Score of employees in the "IT" department to 5 if it is NaN
df.loc[(df['Department'] == 'IT') & (df['Performance Score'].isna()), 'Performance Score'] = 5

print(df)

       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
995   996       Pamela Reeves   49  Female      Sales    7652   2024-06-23
996   997        Todd Johnson   29  Female      Sales    6754   2018-07-20
997   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
998   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
999  1000         Shawn Scott   45    Male         IT    7364   2022-07-31

     Performance Score  Experience   Status     Location  Session  \
0                  2.0          16   Active     New York    Night
1                  2.0          11  Retired  Los Angeles  Evening
2                  NaN           1  Retired     New York  Morning
3                  2.0          13  Retired  Los Angeles  Evening
4                  5.0          16  Retired     New York  Evening
..                 ...         ...      ...          ...      ...
995                4.0           3   Active  Los Angeles  Evening
996                NaN          12  Retired     New York  Morning
997                5.0           3   Active     New York  Morning
998                4.0           9  Retired  Los Angeles  Evening
999                2.0           4   Active     New York  Morning

     Years With Company  Bonus
0                     9  564.1
1                     4  424.9
2                     5  305.8
3                     7  589.5
4                     4  431.7
..                  ...    ...
995                   0  765.2
996                   6  675.4
997                   1  527.8
998                   2  543.7
999                   2  736.4

[1000 rows x 14 columns]

In [17]:
# Modify the Experience of employees with less than 2 years to 2. 

df.loc[df['Experience'] < 2, 'Experience'] = 2

print(df)

       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
995   996       Pamela Reeves   49  Female      Sales    7652   2024-06-23
996   997        Todd Johnson   29  Female      Sales    6754   2018-07-20
997   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
998   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
999  1000         Shawn Scott   45    Male         IT    7364   2022-07-31

     Performance Score  Experience   Status     Location  Session  \
0                  2.0          16   Active     New York    Night
1                  2.0          11  Retired  Los Angeles  Evening
2                  NaN           2  Retired     New York  Morning
3                  2.0          13  Retired  Los Angeles  Evening
4                  5.0          16  Retired     New York  Evening
..                 ...         ...      ...          ...      ...
995                4.0           3   Active  Los Angeles  Evening
996                NaN          12  Retired     New York  Morning
997                5.0           3   Active     New York  Morning
998                4.0           9  Retired  Los Angeles  Evening
999                2.0           4   Active     New York  Morning

     Years With Company  Bonus
0                     9  564.1
1                     4  424.9
2                     5  305.8
3                     7  589.5
4                     4  431.7
..                  ...    ...
995                   0  765.2
996                   6  675.4
997                   1  527.8
998                   2  543.7
999                   2  736.4

[1000 rows x 14 columns]

In [18]:
#Normalize the Salary column so that all values are between 0 and 1
#perform normalization using salary-salary.min()//(salary.max()-salary.min()): feature scaling

df['Normalized Salary'] = (df['Salary'] - df['Salary'].min()) / (df['Salary'].max() - df['Salary'].min())

print(df)

       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
995   996       Pamela Reeves   49  Female      Sales    7652   2024-06-23
996   997        Todd Johnson   29  Female      Sales    6754   2018-07-20
997   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
998   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
999  1000         Shawn Scott   45    Male         IT    7364   2022-07-31

     Performance Score  Experience   Status     Location  Session  \
0                  2.0          16   Active     New York    Night
1                  2.0          11  Retired  Los Angeles  Evening
2                  NaN           2  Retired     New York  Morning
3                  2.0          13  Retired  Los Angeles  Evening
4                  5.0          16  Retired     New York  Evening
..                 ...         ...      ...          ...      ...
995                4.0           3   Active  Los Angeles  Evening
996                NaN          12  Retired     New York  Morning
997                5.0           3   Active     New York  Morning
998                4.0           9  Retired  Los Angeles  Evening
999                2.0           4   Active     New York  Morning

     Years With Company  Bonus  Normalized Salary
0                     9  564.1           0.454500
1                     4  424.9           0.280020
2                     5  305.8           0.130735
3                     7  589.5           0.486337
4                     4  431.7           0.288543
..                  ...    ...                ...
995                   0  765.2           0.706568
996                   6  675.4           0.594009
997                   1  527.8           0.409000
998                   2  543.7           0.428930
999                   2  736.4           0.670469

[1000 rows x 15 columns]

In [19]:
# Replace all Location values with "Remote" for employees with a Performance Score below 3.
df.loc[df['Performance Score'] < 3, 'Location'] = 'Remote'

print(df)

       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
995   996       Pamela Reeves   49  Female      Sales    7652   2024-06-23
996   997        Todd Johnson   29  Female      Sales    6754   2018-07-20
997   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
998   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
999  1000         Shawn Scott   45    Male         IT    7364   2022-07-31

     Performance Score  Experience   Status     Location  Session  \
0                  2.0          16   Active       Remote    Night
1                  2.0          11  Retired       Remote  Evening
2                  NaN           2  Retired     New York  Morning
3                  2.0          13  Retired       Remote  Evening
4                  5.0          16  Retired     New York  Evening
..                 ...         ...      ...          ...      ...
995                4.0           3   Active  Los Angeles  Evening
996                NaN          12  Retired     New York  Morning
997                5.0           3   Active     New York  Morning
998                4.0           9  Retired  Los Angeles  Evening
999                2.0           4   Active       Remote  Morning

     Years With Company  Bonus  Normalized Salary
0                     9  564.1           0.454500
1                     4  424.9           0.280020
2                     5  305.8           0.130735
3                     7  589.5           0.486337
4                     4  431.7           0.288543
..                  ...    ...                ...
995                   0  765.2           0.706568
996                   6  675.4           0.594009
997                   1  527.8           0.409000
998                   2  543.7           0.428930
999                   2  736.4           0.670469

[1000 rows x 15 columns]

In [20]:
#Original Dataset
original = pd.read_csv('/kaggle/input/employee-performance-and-salary-dataset/Employe_Performance_dataset.csv')
print(original)

       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
995   996       Pamela Reeves   49  Female      Sales    7652   2024-06-23
996   997        Todd Johnson   29  Female      Sales    6754   2018-07-20
997   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
998   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
999  1000         Shawn Scott   45    Male         IT    7364   2022-07-31

     Performance Score  Experience    Status     Location  Session
0                  2.0          16    Active     New York    Night
1                  2.0          11  Inactive  Los Angeles  Evening
2                  NaN           1  Inactive     New York  Morning
3                  2.0          13  Inactive  Los Angeles  Evening
4                  5.0          16  Inactive     New York  Evening
..                 ...         ...       ...          ...      ...
995                4.0           3    Active  Los Angeles  Evening
996                NaN          12  Inactive     New York  Morning
997                5.0           3    Active     New York  Morning
998                4.0           9  Inactive  Los Angeles  Evening
999                2.0           4    Active     New York  Morning

[1000 rows x 12 columns]

In [21]:
#. Create a new column Experience Level with values "Junior", "Mid", or "Senior" based on the 
#Experience.
conditions = [
    (df['Experience'] < 5),  
    (df['Experience'] >= 5) & (df['Experience'] < 10), 
    (df['Experience'] >= 10)]

experience_levels = ['Junior', 'Mid', 'Senior']

df['Experience Level'] = np.select(conditions, experience_levels, default='Unknown')

print(df)

       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
995   996       Pamela Reeves   49  Female      Sales    7652   2024-06-23
996   997        Todd Johnson   29  Female      Sales    6754   2018-07-20
997   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
998   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
999  1000         Shawn Scott   45    Male         IT    7364   2022-07-31

     Performance Score  Experience   Status     Location  Session  \
0                  2.0          16   Active       Remote    Night
1                  2.0          11  Retired       Remote  Evening
2                  NaN           2  Retired     New York  Morning
3                  2.0          13  Retired       Remote  Evening
4                  5.0          16  Retired     New York  Evening
..                 ...         ...      ...          ...      ...
995                4.0           3   Active  Los Angeles  Evening
996                NaN          12  Retired     New York  Morning
997                5.0           3   Active     New York  Morning
998                4.0           9  Retired  Los Angeles  Evening
999                2.0           4   Active       Remote  Morning

     Years With Company  Bonus  Normalized Salary Experience Level
0                     9  564.1           0.454500           Senior
1                     4  424.9           0.280020           Senior
2                     5  305.8           0.130735           Junior
3                     7  589.5           0.486337           Senior
4                     4  431.7           0.288543           Senior
..                  ...    ...                ...              ...
995                   0  765.2           0.706568           Junior
996                   6  675.4           0.594009           Senior
997                   1  527.8           0.409000           Junior
998                   2  543.7           0.428930              Mid
999                   2  736.4           0.670469           Junior

[1000 rows x 16 columns]

In [22]:
# Convert the 'Joining Date' column to datetime format
df['Joining Date'] = pd.to_datetime(df['Joining Date'])

# Reformat the 'Joining Date' column to 'YYYY-MM-DD' format
df['Joining Date'] = df['Joining Date'].dt.strftime('%Y-%m-%d')

print(df[['Name', 'Joining Date']].tail())

                Name Joining Date
995    Pamela Reeves   2024-06-23
996     Todd Johnson   2018-07-20
997  Michael Sanchez   2023-07-05
998    Ashley Taylor   2022-02-18
999      Shawn Scott   2022-07-31

In [23]:
# Add a new row with specific values using the append() method. 
#since the DataFrame object has no value append , I would use concatenation

new_row = {
    'ID': 1001,
    'Name': 'Nicole Otieno',
    'Age': 28,
    'Gender': 'Female',
    'Department': 'IT',
    'Salary': 5500,
    'Joining Date': '2024-12-11',
    'Performance Score': 4.5,
    'Experience': 3,
    'Status': 'Active',
    'Location': 'New York',
    'Session': 'Night',
    'Years With Company': 1,
    'Bonus': 550.0,
    'Experience Level': 'Junior'
}

new_row_df = pd.DataFrame([new_row])


df = pd.concat([df, new_row_df], ignore_index=True)
# To check the last rows after 
print(df)

        ID                Name  Age  Gender Department  Salary Joining Date  \
0        1        Cory Escobar   48  Female         HR    5641   2015-05-03
1        2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2        3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3        4  Christine Williams   58  Female         IT    5895   2017-09-08
4        5        Amber Harris   35   Other         IT    4317   2020-02-15
...    ...                 ...  ...     ...        ...     ...          ...
996    997        Todd Johnson   29  Female      Sales    6754   2018-07-20
997    998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
998    999       Ashley Taylor   51  Female         IT    5437   2022-02-18
999   1000         Shawn Scott   45    Male         IT    7364   2022-07-31
1000  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11

      Performance Score  Experience   Status     Location  Session  \
0                   2.0          16   Active       Remote    Night
1                   2.0          11  Retired       Remote  Evening
2                   NaN           2  Retired     New York  Morning
3                   2.0          13  Retired       Remote  Evening
4                   5.0          16  Retired     New York  Evening
...                 ...         ...      ...          ...      ...
996                 NaN          12  Retired     New York  Morning
997                 5.0           3   Active     New York  Morning
998                 4.0           9  Retired  Los Angeles  Evening
999                 2.0           4   Active       Remote  Morning
1000                4.5           3   Active     New York    Night

      Years With Company  Bonus  Normalized Salary Experience Level
0                      9  564.1           0.454500           Senior
1                      4  424.9           0.280020           Senior
2                      5  305.8           0.130735           Junior
3                      7  589.5           0.486337           Senior
4                      4  431.7           0.288543           Senior
...                  ...    ...                ...              ...
996                    6  675.4           0.594009           Senior
997                    1  527.8           0.409000           Junior
998                    2  543.7           0.428930              Mid
999                    2  736.4           0.670469           Junior
1000                   1  550.0                NaN           Junior

[1001 rows x 16 columns]

In [24]:
# Delete the column Session from the DataFrame.
#First save the session data for easy retrieval.
session_data = df['Session'].copy()
df = df.drop(columns=['Session'])

print(df.head())
#check if the session copy has been saved.
print(session_data.head())

   ID                Name  Age  Gender Department  Salary Joining Date  \
0   1        Cory Escobar   48  Female         HR    5641   2015-05-03
1   2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2   3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3   4  Christine Williams   58  Female         IT    5895   2017-09-08
4   5        Amber Harris   35   Other         IT    4317   2020-02-15

   Performance Score  Experience   Status  Location  Years With Company  \
0                2.0          16   Active    Remote                   9
1                2.0          11  Retired    Remote                   4
2                NaN           2  Retired  New York                   5
3                2.0          13  Retired    Remote                   7
4                5.0          16  Retired  New York                   4

   Bonus  Normalized Salary Experience Level
0  564.1           0.454500           Senior
1  424.9           0.280020           Senior
2  305.8           0.130735           Junior
3  589.5           0.486337           Senior
4  431.7           0.288543           Senior
0      Night
1    Evening
2    Morning
3    Evening
4    Evening
Name: Session, dtype: object

In [25]:
# Delete rows where the Age is greater than 60.
#Filter.
df = df[df['Age'] <= 60]

print(df)

        ID                Name  Age  Gender Department  Salary Joining Date  \
0        1        Cory Escobar   48  Female         HR    5641   2015-05-03
1        2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2        3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3        4  Christine Williams   58  Female         IT    5895   2017-09-08
4        5        Amber Harris   35   Other         IT    4317   2020-02-15
...    ...                 ...  ...     ...        ...     ...          ...
996    997        Todd Johnson   29  Female      Sales    6754   2018-07-20
997    998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
998    999       Ashley Taylor   51  Female         IT    5437   2022-02-18
999   1000         Shawn Scott   45    Male         IT    7364   2022-07-31
1000  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11

      Performance Score  Experience   Status     Location  Years With Company  \
0                   2.0          16   Active       Remote                   9
1                   2.0          11  Retired       Remote                   4
2                   NaN           2  Retired     New York                   5
3                   2.0          13  Retired       Remote                   7
4                   5.0          16  Retired     New York                   4
...                 ...         ...      ...          ...                 ...
996                 NaN          12  Retired     New York                   6
997                 5.0           3   Active     New York                   1
998                 4.0           9  Retired  Los Angeles                   2
999                 2.0           4   Active       Remote                   2
1000                4.5           3   Active     New York                   1

      Bonus  Normalized Salary Experience Level
0     564.1           0.454500           Senior
1     424.9           0.280020           Senior
2     305.8           0.130735           Junior
3     589.5           0.486337           Senior
4     431.7           0.288543           Senior
...     ...                ...              ...
996   675.4           0.594009           Senior
997   527.8           0.409000           Junior
998   543.7           0.428930              Mid
999   736.4           0.670469           Junior
1000  550.0                NaN           Junior

[894 rows x 15 columns]

In [26]:
 #Add a new column Age Group with values "Young", "Middle-aged", or "Senior" based on Age.
conditions=[
    (df['Age']<30),
    (df['Age']>=30) & (df['Age']<45),
    (df['Age']>=45)
]
age_group=['Young','Middle-aged','Senior']

df['Age Group'] = np.select(conditions, age_group, default='Unknown')

print(df)

        ID                Name  Age  Gender Department  Salary Joining Date  \
0        1        Cory Escobar   48  Female         HR    5641   2015-05-03
1        2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2        3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3        4  Christine Williams   58  Female         IT    5895   2017-09-08
4        5        Amber Harris   35   Other         IT    4317   2020-02-15
...    ...                 ...  ...     ...        ...     ...          ...
996    997        Todd Johnson   29  Female      Sales    6754   2018-07-20
997    998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
998    999       Ashley Taylor   51  Female         IT    5437   2022-02-18
999   1000         Shawn Scott   45    Male         IT    7364   2022-07-31
1000  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11

      Performance Score  Experience   Status     Location  Years With Company  \
0                   2.0          16   Active       Remote                   9
1                   2.0          11  Retired       Remote                   4
2                   NaN           2  Retired     New York                   5
3                   2.0          13  Retired       Remote                   7
4                   5.0          16  Retired     New York                   4
...                 ...         ...      ...          ...                 ...
996                 NaN          12  Retired     New York                   6
997                 5.0           3   Active     New York                   1
998                 4.0           9  Retired  Los Angeles                   2
999                 2.0           4   Active       Remote                   2
1000                4.5           3   Active     New York                   1

      Bonus  Normalized Salary Experience Level    Age Group
0     564.1           0.454500           Senior       Senior
1     424.9           0.280020           Senior        Young
2     305.8           0.130735           Junior       Senior
3     589.5           0.486337           Senior       Senior
4     431.7           0.288543           Senior  Middle-aged
...     ...                ...              ...          ...
996   675.4           0.594009           Senior        Young
997   527.8           0.409000           Junior        Young
998   543.7           0.428930              Mid       Senior
999   736.4           0.670469           Junior       Senior
1000  550.0                NaN           Junior        Young

[894 rows x 16 columns]

In [27]:
# Identify all columns with missing values using the isna() method. 
missing_columns = df.isna().any()

print(missing_columns[missing_columns == True].index.tolist())

['Performance Score', 'Normalized Salary']

In [28]:
#Fill the missing values in Performance Score with the average score of that column.
#Todd Johnson, index 996 had a missing value at Perfomence Score
average_score = df['Performance Score'].mean()

df['Performance Score'] = df['Performance Score'].fillna(average_score)

print(df)

        ID                Name  Age  Gender Department  Salary Joining Date  \
0        1        Cory Escobar   48  Female         HR    5641   2015-05-03
1        2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2        3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3        4  Christine Williams   58  Female         IT    5895   2017-09-08
4        5        Amber Harris   35   Other         IT    4317   2020-02-15
...    ...                 ...  ...     ...        ...     ...          ...
996    997        Todd Johnson   29  Female      Sales    6754   2018-07-20
997    998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
998    999       Ashley Taylor   51  Female         IT    5437   2022-02-18
999   1000         Shawn Scott   45    Male         IT    7364   2022-07-31
1000  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11

      Performance Score  Experience   Status     Location  Years With Company  \
0              2.000000          16   Active       Remote                   9
1              2.000000          11  Retired       Remote                   4
2              3.443615           2  Retired     New York                   5
3              2.000000          13  Retired       Remote                   7
4              5.000000          16  Retired     New York                   4
...                 ...         ...      ...          ...                 ...
996            3.443615          12  Retired     New York                   6
997            5.000000           3   Active     New York                   1
998            4.000000           9  Retired  Los Angeles                   2
999            2.000000           4   Active       Remote                   2
1000           4.500000           3   Active     New York                   1

      Bonus  Normalized Salary Experience Level    Age Group
0     564.1           0.454500           Senior       Senior
1     424.9           0.280020           Senior        Young
2     305.8           0.130735           Junior       Senior
3     589.5           0.486337           Senior       Senior
4     431.7           0.288543           Senior  Middle-aged
...     ...                ...              ...          ...
996   675.4           0.594009           Senior        Young
997   527.8           0.409000           Junior        Young
998   543.7           0.428930              Mid       Senior
999   736.4           0.670469           Junior       Senior
1000  550.0                NaN           Junior        Young

[894 rows x 16 columns]

In [29]:
# Drop all rows with missing values using the dropna() method.
#Nicole still has a missing value at Normalized salary hence will be dropped.
#Drops rows with NaN but keeps the original dataframe intact.
df_cleaned = df.dropna()

print(df_cleaned)

       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
995   996       Pamela Reeves   49  Female      Sales    7652   2024-06-23
996   997        Todd Johnson   29  Female      Sales    6754   2018-07-20
997   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
998   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
999  1000         Shawn Scott   45    Male         IT    7364   2022-07-31

     Performance Score  Experience   Status     Location  Years With Company  \
0             2.000000          16   Active       Remote                   9
1             2.000000          11  Retired       Remote                   4
2             3.443615           2  Retired     New York                   5
3             2.000000          13  Retired       Remote                   7
4             5.000000          16  Retired     New York                   4
..                 ...         ...      ...          ...                 ...
995           4.000000           3   Active  Los Angeles                   0
996           3.443615          12  Retired     New York                   6
997           5.000000           3   Active     New York                   1
998           4.000000           9  Retired  Los Angeles                   2
999           2.000000           4   Active       Remote                   2

     Bonus  Normalized Salary Experience Level    Age Group
0    564.1           0.454500           Senior       Senior
1    424.9           0.280020           Senior        Young
2    305.8           0.130735           Junior       Senior
3    589.5           0.486337           Senior       Senior
4    431.7           0.288543           Senior  Middle-aged
..     ...                ...              ...          ...
995  765.2           0.706568           Junior       Senior
996  675.4           0.594009           Senior        Young
997  527.8           0.409000           Junior        Young
998  543.7           0.428930              Mid       Senior
999  736.4           0.670469           Junior       Senior

[893 rows x 16 columns]

In [30]:
# Replace missing values in Performance Score with the median of the scores, grouped by Department.
missing_rows_before = df[df['Performance Score'].isna()]
median_scores = df.groupby('Department')['Performance Score'].median()
# Step 3: Replace missing values with the department's median
df['Performance Score'] = df.apply(
    lambda row: median_scores[row['Department']] if pd.isna(row['Performance Score']) else row['Performance Score'], 
    axis=1
)

# Step 4: Identify rows that were previously missing and are now filled
missing_rows_after = df[df.index.isin(missing_rows_before.index)]

print(f"Rows that had missing values and were re-manipulated:\n{missing_rows_after}")
print("\nUpdated DataFrame:\n", df)

Rows that had missing values and were re-manipulated:
Empty DataFrame
Columns: [ID, Name, Age, Gender, Department, Salary, Joining Date, Performance Score, Experience, Status, Location, Years With Company, Bonus, Normalized Salary, Experience Level, Age Group]
Index: []

Updated DataFrame:
         ID                Name  Age  Gender Department  Salary Joining Date  \
0        1        Cory Escobar   48  Female         HR    5641   2015-05-03
1        2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2        3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3        4  Christine Williams   58  Female         IT    5895   2017-09-08
4        5        Amber Harris   35   Other         IT    4317   2020-02-15
...    ...                 ...  ...     ...        ...     ...          ...
996    997        Todd Johnson   29  Female      Sales    6754   2018-07-20
997    998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
998    999       Ashley Taylor   51  Female         IT    5437   2022-02-18
999   1000         Shawn Scott   45    Male         IT    7364   2022-07-31
1000  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11

      Performance Score  Experience   Status     Location  Years With Company  \
0              2.000000          16   Active       Remote                   9
1              2.000000          11  Retired       Remote                   4
2              3.443615           2  Retired     New York                   5
3              2.000000          13  Retired       Remote                   7
4              5.000000          16  Retired     New York                   4
...                 ...         ...      ...          ...                 ...
996            3.443615          12  Retired     New York                   6
997            5.000000           3   Active     New York                   1
998            4.000000           9  Retired  Los Angeles                   2
999            2.000000           4   Active       Remote                   2
1000           4.500000           3   Active     New York                   1

      Bonus  Normalized Salary Experience Level    Age Group
0     564.1           0.454500           Senior       Senior
1     424.9           0.280020           Senior        Young
2     305.8           0.130735           Junior       Senior
3     589.5           0.486337           Senior       Senior
4     431.7           0.288543           Senior  Middle-aged
...     ...                ...              ...          ...
996   675.4           0.594009           Senior        Young
997   527.8           0.409000           Junior        Young
998   543.7           0.428930              Mid       Senior
999   736.4           0.670469           Junior       Senior
1000  550.0                NaN           Junior        Young

[894 rows x 16 columns]

In [31]:
#26 Identify rows where the employee is in the "IT" department and their Age is above the average Age 
#of "IT" employees
average_age_it = df[df['Department'] == 'IT']['Age'].mean()
it_dept_above_average_age= df[(df['Department']=='IT') & (df['Age'] >average_age_it)]
print(it_dept_above_average_age)

       ID                Name  Age  Gender Department  Salary Joining Date  \
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
33     34    Mr. Brian Nelson   42  Female         IT    5207   2017-08-17
34     35            Lisa Fry   51  Female         IT    9259   2017-09-26
41     42      Charles Mccall   58   Other         IT    9512   2024-11-10
47     48        Jake Johnson   48   Other         IT    5848   2017-02-03
..    ...                 ...  ...     ...        ...     ...          ...
979   980    Crystal Espinoza   55  Female         IT    4952   2023-09-04
984   985        Jeffrey Hall   41   Other         IT    8768   2018-08-27
986   987     Melissa Bradley   39  Female         IT    9618   2015-07-05
998   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
999  1000         Shawn Scott   45    Male         IT    7364   2022-07-31

     Performance Score  Experience   Status     Location  Years With Company  \
3                  2.0          13  Retired       Remote                   7
33                 1.0           4   Active       Remote                   7
34                 4.0          17  Retired  Los Angeles                   7
41                 5.0           8  Retired  Los Angeles                   0
47                 3.0           2   Active  Los Angeles                   7
..                 ...         ...      ...          ...                 ...
979                2.0           5   Active       Remote                   1
984                3.0          16  Retired  Los Angeles                   6
986                1.0          13   Active       Remote                   9
998                4.0           9  Retired  Los Angeles                   2
999                2.0           4   Active       Remote                   2

     Bonus  Normalized Salary Experience Level    Age Group
3    589.5           0.486337           Senior       Senior
33   520.7           0.400100           Junior  Middle-aged
34   925.9           0.907997           Senior       Senior
41   951.2           0.939709              Mid       Senior
47   584.8           0.480446           Junior       Senior
..     ...                ...              ...          ...
979  495.2           0.368137              Mid       Senior
984  876.8           0.846453           Senior  Middle-aged
986  961.8           0.952996           Senior  Middle-aged
998  543.7           0.428930              Mid       Senior
999  736.4           0.670469           Junior       Senior

[150 rows x 16 columns]

In [32]:
# add a duplicate row
new_row = {
    'ID': 1001,
    'Name': 'Nicole Otieno',
    'Age': 28,
    'Gender': 'Female',
    'Department': 'IT',
    'Salary': 5500,
    'Joining Date': '2024-12-11',
    'Performance Score': 4.5,
    'Experience': 3,
    'Status': 'Active',
    'Location': 'New York',
    'Session': 'Night',
    'Years With Company': 1,
    'Bonus': 550.0,
    'Experience Level': 'Junior'
}

new_row_df = pd.DataFrame([new_row])


df = pd.concat([df, new_row_df], ignore_index=True)
# To check the last rows after 
print(df)

       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
890   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
891   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
892  1000         Shawn Scott   45    Male         IT    7364   2022-07-31
893  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11
894  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11

     Performance Score  Experience   Status     Location  Years With Company  \
0             2.000000          16   Active       Remote                   9
1             2.000000          11  Retired       Remote                   4
2             3.443615           2  Retired     New York                   5
3             2.000000          13  Retired       Remote                   7
4             5.000000          16  Retired     New York                   4
..                 ...         ...      ...          ...                 ...
890           5.000000           3   Active     New York                   1
891           4.000000           9  Retired  Los Angeles                   2
892           2.000000           4   Active       Remote                   2
893           4.500000           3   Active     New York                   1
894           4.500000           3   Active     New York                   1

     Bonus  Normalized Salary Experience Level    Age Group Session
0    564.1           0.454500           Senior       Senior     NaN
1    424.9           0.280020           Senior        Young     NaN
2    305.8           0.130735           Junior       Senior     NaN
3    589.5           0.486337           Senior       Senior     NaN
4    431.7           0.288543           Senior  Middle-aged     NaN
..     ...                ...              ...          ...     ...
890  527.8           0.409000           Junior        Young     NaN
891  543.7           0.428930              Mid       Senior     NaN
892  736.4           0.670469           Junior       Senior     NaN
893  550.0                NaN           Junior        Young     NaN
894  550.0                NaN           Junior          NaN   Night

[895 rows x 17 columns]

In [33]:
#27 . Identify rows with duplicate Name and Joining Date combinations, and remove duplicates. 
#a)step 1: identify duplicatees there is a duplicate because I added another row with Nicole, initially it was an empty dataframe.
duplicates = df[df.duplicated(subset=['Name', 'Joining Date'], keep=False)]

print("Duplicate rows:")
print(duplicates)

Duplicate rows:
       ID           Name  Age  Gender Department  Salary Joining Date  \
893  1001  Nicole Otieno   28  Female         IT    5500   2024-12-11
894  1001  Nicole Otieno   28  Female         IT    5500   2024-12-11

     Performance Score  Experience  Status  Location  Years With Company  \
893                4.5           3  Active  New York                   1
894                4.5           3  Active  New York                   1

     Bonus  Normalized Salary Experience Level Age Group Session
893  550.0                NaN           Junior     Young     NaN
894  550.0                NaN           Junior       NaN   Night

In [34]:
#b)Remove duplicates.
df_cleaned = df.drop_duplicates(subset=['Name', 'Joining Date'], keep='first')
print(df_cleaned)

       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
889   997        Todd Johnson   29  Female      Sales    6754   2018-07-20
890   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
891   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
892  1000         Shawn Scott   45    Male         IT    7364   2022-07-31
893  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11

     Performance Score  Experience   Status     Location  Years With Company  \
0             2.000000          16   Active       Remote                   9
1             2.000000          11  Retired       Remote                   4
2             3.443615           2  Retired     New York                   5
3             2.000000          13  Retired       Remote                   7
4             5.000000          16  Retired     New York                   4
..                 ...         ...      ...          ...                 ...
889           3.443615          12  Retired     New York                   6
890           5.000000           3   Active     New York                   1
891           4.000000           9  Retired  Los Angeles                   2
892           2.000000           4   Active       Remote                   2
893           4.500000           3   Active     New York                   1

     Bonus  Normalized Salary Experience Level    Age Group Session
0    564.1           0.454500           Senior       Senior     NaN
1    424.9           0.280020           Senior        Young     NaN
2    305.8           0.130735           Junior       Senior     NaN
3    589.5           0.486337           Senior       Senior     NaN
4    431.7           0.288543           Senior  Middle-aged     NaN
..     ...                ...              ...          ...     ...
889  675.4           0.594009           Senior        Young     NaN
890  527.8           0.409000           Junior        Young     NaN
891  543.7           0.428930              Mid       Senior     NaN
892  736.4           0.670469           Junior       Senior     NaN
893  550.0                NaN           Junior        Young     NaN

[894 rows x 17 columns]

In [35]:
#. Remove rows where the Experience value is inconsistent with the Age (e.g., Experience > Age - 18). 
#a)find inconsistent rows
inconsistent_condition = df['Experience'] > (df['Age'] - 18)
inconsistent_rows = df[inconsistent_condition]
print(inconsistent_rows)

#b)remove inconsistent rows
df_cleaned1 = df[~inconsistent_condition] #dataframe excluding inconsistent rows
print(df_cleaned1 )

      ID                Name  Age  Gender Department  Salary Joining Date  \
1      2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
12    15  Matthew Collins MD   31  Female      Sales    8568   2020-06-01
20    25       Tracy Carlson   21    Male         HR    9275   2022-04-09
22    27         Austin Long   20  Female         IT    4899   2024-05-01
24    30       Rachel Ramsey   22    Male      Sales    9661   2016-08-18
..   ...                 ...  ...     ...        ...     ...          ...
884  992     William Schultz   23   Other      Sales    4311   2019-08-17
885  993      Ashley Daniels   25   Other      Sales    5524   2022-11-24
887  995     Rachel Phillips   22    Male         IT    3096   2018-10-27
889  997        Todd Johnson   29  Female      Sales    6754   2018-07-20
890  998     Michael Sanchez   18    Male      Sales    5278   2023-07-05

     Performance Score  Experience   Status     Location  Years With Company  \
1             2.000000          11  Retired       Remote                   4
12            3.443615          20  Retired  Los Angeles                   4
20            4.000000          12   Active     New York                   2
22            5.000000           8  Retired      Chicago                   0
24            2.000000          17  Retired       Remote                   8
..                 ...         ...      ...          ...                 ...
884           3.443615          10  Retired  Los Angeles                   5
885           3.443615           8  Retired     New York                   2
887           2.000000           7  Retired       Remote                   6
889           3.443615          12  Retired     New York                   6
890           5.000000           3   Active     New York                   1

     Bonus  Normalized Salary Experience Level    Age Group Session
1    424.9           0.280020           Senior        Young     NaN
12   856.8           0.821384           Senior  Middle-aged     NaN
20   927.5           0.910003           Senior        Young     NaN
22   489.9           0.361494              Mid        Young     NaN
24   966.1           0.958386           Senior        Young     NaN
..     ...                ...              ...          ...     ...
884  431.1           0.287791           Senior        Young     NaN
885  552.4           0.439835              Mid        Young     NaN
887  309.6           0.135498              Mid        Young     NaN
889  675.4           0.594009           Senior        Young     NaN
890  527.8           0.409000           Junior        Young     NaN

[234 rows x 17 columns]
       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
5       6         Ashley Howe   29  Female         HR    2591   2016-06-24
..    ...                 ...  ...     ...        ...     ...          ...
888   996       Pamela Reeves   49  Female      Sales    7652   2024-06-23
891   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
892  1000         Shawn Scott   45    Male         IT    7364   2022-07-31
893  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11
894  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11

     Performance Score  Experience   Status     Location  Years With Company  \
0             2.000000          16   Active       Remote                   9
2             3.443615           2  Retired     New York                   5
3             2.000000          13  Retired       Remote                   7
4             5.000000          16  Retired     New York                   4
5             1.000000           6   Active       Remote                   8
..                 ...         ...      ...          ...                 ...
888           4.000000           3   Active  Los Angeles                   0
891           4.000000           9  Retired  Los Angeles                   2
892           2.000000           4   Active       Remote                   2
893           4.500000           3   Active     New York                   1
894           4.500000           3   Active     New York                   1

     Bonus  Normalized Salary Experience Level    Age Group Session
0    564.1           0.454500           Senior       Senior     NaN
2    305.8           0.130735           Junior       Senior     NaN
3    589.5           0.486337           Senior       Senior     NaN
4    431.7           0.288543           Senior  Middle-aged     NaN
5    259.1           0.072199              Mid        Young     NaN
..     ...                ...              ...          ...     ...
888  765.2           0.706568           Junior       Senior     NaN
891  543.7           0.428930              Mid       Senior     NaN
892  736.4           0.670469           Junior       Senior     NaN
893  550.0                NaN           Junior        Young     NaN
894  550.0                NaN           Junior          NaN   Night

[661 rows x 17 columns]

In [36]:
#29 Sort the DataFrame by Salary in descending order. 
df_sorted = df.sort_values(by='Salary', ascending=False) # to sort in ascending set ascending to True.
print(df_sorted)

      ID                Name  Age  Gender Department  Salary Joining Date  \
721  812        Jesse Miller   52    Male         HR    9993   2020-11-27
471  532  Jeffrey Williamson   54   Other         IT    9988   2015-12-08
882  990       Shannon Meyer   18   Other         HR    9985   2022-11-05
837  938       Gary Mitchell   52  Female      Sales    9963   2016-09-22
811  909       Sara Martinez   34   Other         HR    9951   2024-02-18
..   ...                 ...  ...     ...        ...     ...          ...
379  427      Patricia Scott   52    Male         HR    2041   2022-11-22
786  883      Jaclyn Collins   47    Male         IT    2029   2019-12-05
64    77       Victor Nelson   47  Female      Sales    2025   2015-05-14
420  474        David Potter   56    Male         IT    2016   2020-07-13
809  907   Christina Carlson   42  Female      Sales    2015   2020-05-08

     Performance Score  Experience   Status     Location  Years With Company  \
721           3.443615          12   Active      Chicago                   4
471           5.000000          16  Retired      Chicago                   9
882           4.000000          18   Active      Chicago                   2
837           5.000000          20  Retired  Los Angeles                   8
811           3.443615           6  Retired     New York                   0
..                 ...         ...      ...          ...                 ...
379           1.000000           8  Retired       Remote                   2
786           5.000000          17   Active  Los Angeles                   5
64            1.000000           5   Active       Remote                   9
420           5.000000          18   Active     New York                   4
809           1.000000          14  Retired       Remote                   4

     Bonus  Normalized Salary Experience Level    Age Group Session
721  999.3           1.000000           Senior       Senior     NaN
471  998.8           0.999373           Senior       Senior     NaN
882  998.5           0.998997           Senior        Young     NaN
837  996.3           0.996240           Senior       Senior     NaN
811  995.1           0.994736              Mid  Middle-aged     NaN
..     ...                ...              ...          ...     ...
379  204.1           0.003259              Mid       Senior     NaN
786  202.9           0.001755           Senior       Senior     NaN
64   202.5           0.001253              Mid       Senior     NaN
420  201.6           0.000125           Senior       Senior     NaN
809  201.5           0.000000           Senior  Middle-aged     NaN

[895 rows x 17 columns]

In [37]:
#30.  Sort the DataFrame by Department and then by Joining Date in ascending order.

df_sorted = df.sort_values(by=['Department', 'Joining Date'], ascending=[True, True])
print(df_sorted)

      ID               Name  Age  Gender Department  Salary Joining Date  \
425  480          Jay Scott   28   Other         HR    5496   2015-01-21
157  181   Sharon Patterson   33    Male         HR    6833   2015-02-04
263  296   Jennifer Nichols   21   Other         HR    4009   2015-02-22
454  515  Taylor Williamson   48    Male         HR    9293   2015-03-10
764  861     Jennifer Smith   23   Other         HR    7176   2015-03-13
..   ...                ...  ...     ...        ...     ...          ...
727  820         Amber Ward   54  Female      Sales    7880   2024-09-19
246  278        Sheryl Gray   22   Other      Sales    4226   2024-10-01
120  142  Matthew Gutierrez   38   Other      Sales    5883   2024-10-22
423  478         Mary Arias   19    Male      Sales    8893   2024-11-14
147  170      George Bowers   24   Other      Sales    6041   2024-12-07

     Performance Score  Experience   Status     Location  Years With Company  \
425           3.443615          18   Active      Chicago                   9
157           3.443615          16   Active     New York                   9
263           2.000000          13  Retired       Remote                   9
454           3.443615          17  Retired      Chicago                   9
764           4.000000           6   Active  Los Angeles                   9
..                 ...         ...      ...          ...                 ...
727           3.000000           6   Active     New York                   0
246           3.443615           8   Active      Chicago                   0
120           4.000000          14  Retired      Chicago                   0
423           3.443615           7   Active      Chicago                   0
147           2.000000           4   Active       Remote                   0

     Bonus  Normalized Salary Experience Level    Age Group Session
425  549.6           0.436325           Senior        Young     NaN
157  683.3           0.603911           Senior  Middle-aged     NaN
263  400.9           0.249937           Senior        Young     NaN
454  929.3           0.912259           Senior       Senior     NaN
764  717.6           0.646904              Mid        Young     NaN
..     ...                ...              ...          ...     ...
727  788.0           0.735147              Mid       Senior     NaN
246  422.6           0.277137              Mid        Young     NaN
120  588.3           0.484833           Senior  Middle-aged     NaN
423  889.3           0.862121              Mid        Young     NaN
147  604.1           0.504638           Junior        Young     NaN

[895 rows x 17 columns]

In [38]:
# 31. Rank all employees by Salary within their Department and add the rank as a new column.
df['Salary Rank'] = df.groupby('Department')['Salary'].rank(ascending=False, method='dense') # dense assigns ranks in a consecutive manner without gaps.
print(df)

       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
890   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
891   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
892  1000         Shawn Scott   45    Male         IT    7364   2022-07-31
893  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11
894  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11

     Performance Score  Experience   Status     Location  Years With Company  \
0             2.000000          16   Active       Remote                   9
1             2.000000          11  Retired       Remote                   4
2             3.443615           2  Retired     New York                   5
3             2.000000          13  Retired       Remote                   7
4             5.000000          16  Retired     New York                   4
..                 ...         ...      ...          ...                 ...
890           5.000000           3   Active     New York                   1
891           4.000000           9  Retired  Los Angeles                   2
892           2.000000           4   Active       Remote                   2
893           4.500000           3   Active     New York                   1
894           4.500000           3   Active     New York                   1

     Bonus  Normalized Salary Experience Level    Age Group Session  \
0    564.1           0.454500           Senior       Senior     NaN
1    424.9           0.280020           Senior        Young     NaN
2    305.8           0.130735           Junior       Senior     NaN
3    589.5           0.486337           Senior       Senior     NaN
4    431.7           0.288543           Senior  Middle-aged     NaN
..     ...                ...              ...          ...     ...
890  527.8           0.409000           Junior        Young     NaN
891  543.7           0.428930              Mid       Senior     NaN
892  736.4           0.670469           Junior       Senior     NaN
893  550.0                NaN           Junior        Young     NaN
894  550.0                NaN           Junior          NaN   Night

     Salary Rank
0          164.0
1          201.0
2          252.0
3          148.0
4          209.0
..           ...
890        159.0
891        167.0
892        108.0
893        161.0
894        161.0

[895 rows x 18 columns]

In [39]:
#32. Sort the dataset by Experience in descending order, but break ties using Performance Score in 
#ascending order. 
df_sorted = df.sort_values(by=['Experience', 'Performance Score'], ascending=[False, True])
print(df_sorted)

      ID            Name  Age  Gender Department  Salary Joining Date  \
318  356  Laura Castillo   41    Male         IT    2392   2024-03-15
344  388     Corey Smith   27   Other      Sales    2593   2017-07-27
357  403   Briana Martin   59    Male      Sales    4496   2023-05-22
477  539  Brandon Church   38    Male         HR    8388   2021-08-02
735  829  Michael Snyder   55   Other      Sales    7497   2024-02-03
..   ...             ...  ...     ...        ...     ...          ...
650  733       Jay Evans   21    Male         HR    8147   2022-03-29
709  798   Melanie Casey   44   Other         HR    4713   2017-10-09
715  804   Jacob Aguilar   23    Male         IT    2372   2020-06-01
783  880    Sarah Thomas   54    Male         IT    6185   2016-10-29
880  988  Danielle Brown   31  Female         IT    5605   2024-06-28

     Performance Score  Experience   Status  Location  Years With Company  \
318                1.0          20  Retired    Remote                   0
344                1.0          20   Active    Remote                   7
357                1.0          20  Retired    Remote                   1
477                1.0          20  Retired    Remote                   3
735                1.0          20  Retired    Remote                   0
..                 ...         ...      ...       ...                 ...
650                5.0           2  Retired   Chicago                   2
709                5.0           2   Active  New York                   7
715                5.0           2  Retired   Chicago                   4
783                5.0           2   Active  New York                   8
880                5.0           2   Active   Chicago                   0

     Bonus  Normalized Salary Experience Level    Age Group Session  \
318  239.2           0.047255           Senior  Middle-aged     NaN
344  259.3           0.072449           Senior        Young     NaN
357  449.6           0.310980           Senior       Senior     NaN
477  838.8           0.798822           Senior  Middle-aged     NaN
735  749.7           0.687140           Senior       Senior     NaN
..     ...                ...              ...          ...     ...
650  814.7           0.768614           Junior        Young     NaN
709  471.3           0.338180           Junior  Middle-aged     NaN
715  237.2           0.044748           Junior        Young     NaN
783  618.5           0.522687           Junior       Senior     NaN
880  560.5           0.449987           Junior  Middle-aged     NaN

     Salary Rank
318        284.0
344        269.0
357        192.0
477         44.0
735         90.0
..           ...
650         59.0
709        188.0
715        286.0
783        136.0
880        156.0

[895 rows x 18 columns]

In [40]:
#33.  Create a new DataFrame containing only employees in "HR" with a Salary above 5000.
hr_salary_above= df[(df['Department']=='HR') & (df['Salary']>5000)]
print(hr_salary_above)

      ID               Name  Age  Gender Department  Salary Joining Date  \
0      1       Cory Escobar   48  Female         HR    5641   2015-05-03
7      8       Amanda Baker   52   Other         HR    6285   2015-04-01
10    12  Rodney Richardson   60   Other         HR    6908   2015-03-14
13    17     Jonathan Perez   59    Male         HR    6586   2019-02-19
15    19     Nancy Stephens   38    Male         HR    9061   2017-07-16
..   ...                ...  ...     ...        ...     ...          ...
844  945     Mary Armstrong   29  Female         HR    9402   2017-12-13
852  954       Ruth Osborne   53    Male         HR    5616   2022-07-31
857  959     Morgan Coleman   51  Female         HR    6415   2022-03-20
877  984        David Moody   43    Male         HR    8830   2021-09-10
882  990      Shannon Meyer   18   Other         HR    9985   2022-11-05

     Performance Score  Experience   Status     Location  Years With Company  \
0             2.000000          16   Active       Remote                   9
7             3.443615           8  Retired      Chicago                   9
10            4.000000          19   Active      Chicago                   9
13            3.000000           7  Retired  Los Angeles                   5
15            5.000000          16  Retired      Chicago                   7
..                 ...         ...      ...          ...                 ...
844           3.443615           2   Active     New York                   7
852           4.000000          16   Active  Los Angeles                   2
857           1.000000           8  Retired       Remote                   2
877           3.443615          19  Retired      Chicago                   3
882           4.000000          18   Active      Chicago                   2

     Bonus  Normalized Salary Experience Level    Age Group Session  \
0    564.1           0.454500           Senior       Senior     NaN
7    628.5           0.535222              Mid       Senior     NaN
10   690.8           0.613312           Senior       Senior     NaN
13   658.6           0.572951              Mid       Senior     NaN
15   906.1           0.883179           Senior  Middle-aged     NaN
..     ...                ...              ...          ...     ...
844  940.2           0.925921           Junior        Young     NaN
852  561.6           0.451366           Senior       Senior     NaN
857  641.5           0.551517              Mid       Senior     NaN
877  883.0           0.854224           Senior  Middle-aged     NaN
882  998.5           0.998997           Senior        Young     NaN

     Salary Rank
0          164.0
7          146.0
10         113.0
13         134.0
15          26.0
..           ...
844         14.0
852        165.0
857        142.0
877         33.0
882          2.0

[184 rows x 18 columns]

In [41]:
#34. . Filter out all rows where the Location is "Chicago". 
df_filtered = df[~df['Location'].isin(['Chicago'])] #negate isin()
print(df_filtered)

       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
890   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
891   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
892  1000         Shawn Scott   45    Male         IT    7364   2022-07-31
893  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11
894  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11

     Performance Score  Experience   Status     Location  Years With Company  \
0             2.000000          16   Active       Remote                   9
1             2.000000          11  Retired       Remote                   4
2             3.443615           2  Retired     New York                   5
3             2.000000          13  Retired       Remote                   7
4             5.000000          16  Retired     New York                   4
..                 ...         ...      ...          ...                 ...
890           5.000000           3   Active     New York                   1
891           4.000000           9  Retired  Los Angeles                   2
892           2.000000           4   Active       Remote                   2
893           4.500000           3   Active     New York                   1
894           4.500000           3   Active     New York                   1

     Bonus  Normalized Salary Experience Level    Age Group Session  \
0    564.1           0.454500           Senior       Senior     NaN
1    424.9           0.280020           Senior        Young     NaN
2    305.8           0.130735           Junior       Senior     NaN
3    589.5           0.486337           Senior       Senior     NaN
4    431.7           0.288543           Senior  Middle-aged     NaN
..     ...                ...              ...          ...     ...
890  527.8           0.409000           Junior        Young     NaN
891  543.7           0.428930              Mid       Senior     NaN
892  736.4           0.670469           Junior       Senior     NaN
893  550.0                NaN           Junior        Young     NaN
894  550.0                NaN           Junior          NaN   Night

     Salary Rank
0          164.0
1          201.0
2          252.0
3          148.0
4          209.0
..           ...
890        159.0
891        167.0
892        108.0
893        161.0
894        161.0

[661 rows x 18 columns]

In [42]:
#35. . Delete all rows where the Performance Score is below 2. 
df_filtered = df[df['Performance Score'] >= 2]
print(df_filtered)

       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
890   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
891   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
892  1000         Shawn Scott   45    Male         IT    7364   2022-07-31
893  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11
894  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11

     Performance Score  Experience   Status     Location  Years With Company  \
0             2.000000          16   Active       Remote                   9
1             2.000000          11  Retired       Remote                   4
2             3.443615           2  Retired     New York                   5
3             2.000000          13  Retired       Remote                   7
4             5.000000          16  Retired     New York                   4
..                 ...         ...      ...          ...                 ...
890           5.000000           3   Active     New York                   1
891           4.000000           9  Retired  Los Angeles                   2
892           2.000000           4   Active       Remote                   2
893           4.500000           3   Active     New York                   1
894           4.500000           3   Active     New York                   1

     Bonus  Normalized Salary Experience Level    Age Group Session  \
0    564.1           0.454500           Senior       Senior     NaN
1    424.9           0.280020           Senior        Young     NaN
2    305.8           0.130735           Junior       Senior     NaN
3    589.5           0.486337           Senior       Senior     NaN
4    431.7           0.288543           Senior  Middle-aged     NaN
..     ...                ...              ...          ...     ...
890  527.8           0.409000           Junior        Young     NaN
891  543.7           0.428930              Mid       Senior     NaN
892  736.4           0.670469           Junior       Senior     NaN
893  550.0                NaN           Junior        Young     NaN
894  550.0                NaN           Junior          NaN   Night

     Salary Rank
0          164.0
1          201.0
2          252.0
3          148.0
4          209.0
..           ...
890        159.0
891        167.0
892        108.0
893        161.0
894        161.0

[800 rows x 18 columns]

In [43]:
#36.  Find the average Salary for each Department.
df_average_by_dept= df.groupby('Department')['Salary'].mean()
print(df_average_by_dept)

Department
HR       5979.931507
IT       5970.266234
Sales    5820.688136
Name: Salary, dtype: float64

In [44]:
#37.  Calculate the total Salary of all employees grouped by Status. 
df_total_salary_by_status = df.groupby('Status')['Salary'].sum()
print(df_total_salary_by_status)

Status
Active     2578104
Retired    2723981
Name: Salary, dtype: int64

In [45]:
#38.  Find the maximum Performance Score for employees in each Location. 
df_maximum_by_location = df.groupby('Location')['Performance Score'].max()
print(df_maximum_by_location)

Location
Chicago        5.0
Los Angeles    5.0
New York       5.0
Remote         2.0
Name: Performance Score, dtype: float64

In [46]:
#39. . Calculate the total Salary paid to employees who joined in each year. 
#find the year of joining
#convert joining date to datetime , in form of year, month then day
df['Joining Date'] = pd.to_datetime(df['Joining Date'])
df['Joining Year'] = df['Joining Date'].dt.year
df_tt_salarypaid= df.groupby('Joining Year')['Salary'].sum()
print(df_tt_salarypaid)

Joining Year
2014     22480
2015    427283
2016    585839
2017    496484
2018    548329
2019    511319
2020    584179
2021    597338
2022    461868
2023    574651
2024    492315
Name: Salary, dtype: int64

In [47]:
#40.  Find the department with the highest average Performance Score.
df_average_by_department = df.groupby('Department')['Performance Score'].mean()
print(df_average_by_department)

#highest average score
df_highest_average = df_average_by_department.max()
print(f"Highest Performance Score is: {df_highest_average}")

#highest average department
df_highest_average_dept = df_average_by_department.idxmax()
print(f"Department with highest Performance Score is :{df_highest_average_dept}")

Department
HR       3.130114
IT       4.009740
Sales    3.166436
Name: Performance Score, dtype: float64
Highest Performance Score is: 4.009740259740259
Department with highest Performance Score is :IT

In [48]:
#41. * Count the number of employees in each Location grouped by their Session.  (Not Complete)
df_employee_no_location_by_session = df.groupby(['Session','Location']).size().reset_index(name='Count')

print(df_employee_no_location_by_session)

  Session  Location  Count
0   Night  New York      1

In [49]:
#42. Group employees by Status and calculate the sum, mean, and standard deviation of their Salary.
employee_by_status = df.groupby('Status').size() #size
print(f'Employee by status size: {employee_by_status}')
employee_by_status_salary_sum = df.groupby('Status')['Salary'].sum()
print(f'Employee by status sum salary : {employee_by_status_salary_sum}')
employee_by_status_salary_mean = df.groupby('Status')['Salary'].mean()
print(f'Employee by status mean salary : {employee_by_status_salary_mean}')
employee_by_status_salary_sd = df.groupby('Status')['Salary'].std()
print(f'Employee by status standard deviation salary : {employee_by_status_salary_sd}')

Employee by status size: Status
Active     439
Retired    456
dtype: int64
Employee by status sum salary : Status
Active     2578104
Retired    2723981
Name: Salary, dtype: int64
Employee by status mean salary : Status
Active     5872.674260
Retired    5973.642544
Name: Salary, dtype: float64
Employee by status standard deviation salary : Status
Active     2329.507276
Retired    2309.554184
Name: Salary, dtype: float64

In [50]:
#43.  Use the apply() method to create a new column Monthly Salary by dividing the Salary by 12.
df['Monthly Salary'] = df['Salary'].apply(lambda x:x/12)
print(df)

       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
890   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
891   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
892  1000         Shawn Scott   45    Male         IT    7364   2022-07-31
893  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11
894  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11

     Performance Score  Experience   Status     Location  Years With Company  \
0             2.000000          16   Active       Remote                   9
1             2.000000          11  Retired       Remote                   4
2             3.443615           2  Retired     New York                   5
3             2.000000          13  Retired       Remote                   7
4             5.000000          16  Retired     New York                   4
..                 ...         ...      ...          ...                 ...
890           5.000000           3   Active     New York                   1
891           4.000000           9  Retired  Los Angeles                   2
892           2.000000           4   Active       Remote                   2
893           4.500000           3   Active     New York                   1
894           4.500000           3   Active     New York                   1

     Bonus  Normalized Salary Experience Level    Age Group Session  \
0    564.1           0.454500           Senior       Senior     NaN
1    424.9           0.280020           Senior        Young     NaN
2    305.8           0.130735           Junior       Senior     NaN
3    589.5           0.486337           Senior       Senior     NaN
4    431.7           0.288543           Senior  Middle-aged     NaN
..     ...                ...              ...          ...     ...
890  527.8           0.409000           Junior        Young     NaN
891  543.7           0.428930              Mid       Senior     NaN
892  736.4           0.670469           Junior       Senior     NaN
893  550.0                NaN           Junior        Young     NaN
894  550.0                NaN           Junior          NaN   Night

     Salary Rank  Joining Year  Monthly Salary
0          164.0          2015      470.083333
1          201.0          2020      354.083333
2          252.0          2019      254.833333
3          148.0          2017      491.250000
4          209.0          2020      359.750000
..           ...           ...             ...
890        159.0          2023      439.833333
891        167.0          2022      453.083333
892        108.0          2022      613.666667
893        161.0          2024      458.333333
894        161.0          2024      458.333333

[895 rows x 20 columns]

In [51]:
#44. . Use the applymap() method to convert all string values in the DataFrame to uppercase.  (use applymap())
df_uppercase = df.map(lambda x: x.upper() if isinstance(x, str) else x)
print(df_uppercase)

       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        CORY ESCOBAR   48  FEMALE         HR    5641   2015-05-03
1       2     TIMOTHY SANCHEZ   25   OTHER      SALES    4249   2020-11-09
2       3        CHAD NICHOLS   57   OTHER      SALES    3058   2019-02-12
3       4  CHRISTINE WILLIAMS   58  FEMALE         IT    5895   2017-09-08
4       5        AMBER HARRIS   35   OTHER         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
890   998     MICHAEL SANCHEZ   18    MALE      SALES    5278   2023-07-05
891   999       ASHLEY TAYLOR   51  FEMALE         IT    5437   2022-02-18
892  1000         SHAWN SCOTT   45    MALE         IT    7364   2022-07-31
893  1001       NICOLE OTIENO   28  FEMALE         IT    5500   2024-12-11
894  1001       NICOLE OTIENO   28  FEMALE         IT    5500   2024-12-11

     Performance Score  Experience   Status     Location  Years With Company  \
0             2.000000          16   ACTIVE       REMOTE                   9
1             2.000000          11  RETIRED       REMOTE                   4
2             3.443615           2  RETIRED     NEW YORK                   5
3             2.000000          13  RETIRED       REMOTE                   7
4             5.000000          16  RETIRED     NEW YORK                   4
..                 ...         ...      ...          ...                 ...
890           5.000000           3   ACTIVE     NEW YORK                   1
891           4.000000           9  RETIRED  LOS ANGELES                   2
892           2.000000           4   ACTIVE       REMOTE                   2
893           4.500000           3   ACTIVE     NEW YORK                   1
894           4.500000           3   ACTIVE     NEW YORK                   1

     Bonus  Normalized Salary Experience Level    Age Group Session  \
0    564.1           0.454500           SENIOR       SENIOR     NaN
1    424.9           0.280020           SENIOR        YOUNG     NaN
2    305.8           0.130735           JUNIOR       SENIOR     NaN
3    589.5           0.486337           SENIOR       SENIOR     NaN
4    431.7           0.288543           SENIOR  MIDDLE-AGED     NaN
..     ...                ...              ...          ...     ...
890  527.8           0.409000           JUNIOR        YOUNG     NaN
891  543.7           0.428930              MID       SENIOR     NaN
892  736.4           0.670469           JUNIOR       SENIOR     NaN
893  550.0                NaN           JUNIOR        YOUNG     NaN
894  550.0                NaN           JUNIOR          NaN   NIGHT

     Salary Rank  Joining Year  Monthly Salary
0          164.0          2015      470.083333
1          201.0          2020      354.083333
2          252.0          2019      254.833333
3          148.0          2017      491.250000
4          209.0          2020      359.750000
..           ...           ...             ...
890        159.0          2023      439.833333
891        167.0          2022      453.083333
892        108.0          2022      613.666667
893        161.0          2024      458.333333
894        161.0          2024      458.333333

[895 rows x 20 columns]

In [52]:
# 45. Create a second dataset containing Department and Budget. Perform an inner join with the original dataset.
department_budget = pd.DataFrame({
    'Department': ['HR', 'IT', 'Sales'],
    'Budget': [1000000, 2000000, 1500000]
})
print(department_budget)
merge_df = pd.merge(df, department_budget , on ='Department', how ='inner')
print(merge_df)

  Department   Budget
0         HR  1000000
1         IT  2000000
2      Sales  1500000
       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
890   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
891   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
892  1000         Shawn Scott   45    Male         IT    7364   2022-07-31
893  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11
894  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11

     Performance Score  Experience   Status  ... Years With Company  Bonus  \
0             2.000000          16   Active  ...                  9  564.1
1             2.000000          11  Retired  ...                  4  424.9
2             3.443615           2  Retired  ...                  5  305.8
3             2.000000          13  Retired  ...                  7  589.5
4             5.000000          16  Retired  ...                  4  431.7
..                 ...         ...      ...  ...                ...    ...
890           5.000000           3   Active  ...                  1  527.8
891           4.000000           9  Retired  ...                  2  543.7
892           2.000000           4   Active  ...                  2  736.4
893           4.500000           3   Active  ...                  1  550.0
894           4.500000           3   Active  ...                  1  550.0

     Normalized Salary  Experience Level    Age Group Session Salary Rank  \
0             0.454500            Senior       Senior     NaN       164.0
1             0.280020            Senior        Young     NaN       201.0
2             0.130735            Junior       Senior     NaN       252.0
3             0.486337            Senior       Senior     NaN       148.0
4             0.288543            Senior  Middle-aged     NaN       209.0
..                 ...               ...          ...     ...         ...
890           0.409000            Junior        Young     NaN       159.0
891           0.428930               Mid       Senior     NaN       167.0
892           0.670469            Junior       Senior     NaN       108.0
893                NaN            Junior        Young     NaN       161.0
894                NaN            Junior          NaN   Night       161.0

     Joining Year  Monthly Salary   Budget
0            2015      470.083333  1000000
1            2020      354.083333  1500000
2            2019      254.833333  1500000
3            2017      491.250000  2000000
4            2020      359.750000  2000000
..            ...             ...      ...
890          2023      439.833333  1500000
891          2022      453.083333  2000000
892          2022      613.666667  2000000
893          2024      458.333333  2000000
894          2024      458.333333  2000000

[895 rows x 21 columns]

In [53]:
# 46.  Merge the dataset with another dataset that includes additional information about employee ID and their recent Projects. 
def assign_project(id):
    if id % 5 == 0:
        return 'Project Alpha'
    elif id % 3 == 0:
        return 'Project Zeta'
    elif id % 2 == 0:
        return 'Project Delta'
    else:
        return 'Project Gamma'
projects_df = pd.DataFrame({
    'ID': range(1, 1002),
    'Recent Projects': [assign_project(id) for id in range(1, 1002)]
})
print(projects_df)
merge_df = pd.merge(df , projects_df, on = 'ID' ,how = 'inner')
print(merge_df)

        ID Recent Projects
0        1   Project Gamma
1        2   Project Delta
2        3    Project Zeta
3        4   Project Delta
4        5   Project Alpha
...    ...             ...
996    997   Project Gamma
997    998   Project Delta
998    999    Project Zeta
999   1000   Project Alpha
1000  1001   Project Gamma

[1001 rows x 2 columns]
       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
890   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
891   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
892  1000         Shawn Scott   45    Male         IT    7364   2022-07-31
893  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11
894  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11

     Performance Score  Experience   Status  ... Years With Company  Bonus  \
0             2.000000          16   Active  ...                  9  564.1
1             2.000000          11  Retired  ...                  4  424.9
2             3.443615           2  Retired  ...                  5  305.8
3             2.000000          13  Retired  ...                  7  589.5
4             5.000000          16  Retired  ...                  4  431.7
..                 ...         ...      ...  ...                ...    ...
890           5.000000           3   Active  ...                  1  527.8
891           4.000000           9  Retired  ...                  2  543.7
892           2.000000           4   Active  ...                  2  736.4
893           4.500000           3   Active  ...                  1  550.0
894           4.500000           3   Active  ...                  1  550.0

     Normalized Salary  Experience Level    Age Group Session Salary Rank  \
0             0.454500            Senior       Senior     NaN       164.0
1             0.280020            Senior        Young     NaN       201.0
2             0.130735            Junior       Senior     NaN       252.0
3             0.486337            Senior       Senior     NaN       148.0
4             0.288543            Senior  Middle-aged     NaN       209.0
..                 ...               ...          ...     ...         ...
890           0.409000            Junior        Young     NaN       159.0
891           0.428930               Mid       Senior     NaN       167.0
892           0.670469            Junior       Senior     NaN       108.0
893                NaN            Junior        Young     NaN       161.0
894                NaN            Junior          NaN   Night       161.0

     Joining Year  Monthly Salary  Recent Projects
0            2015      470.083333    Project Gamma
1            2020      354.083333    Project Delta
2            2019      254.833333     Project Zeta
3            2017      491.250000    Project Delta
4            2020      359.750000    Project Alpha
..            ...             ...              ...
890          2023      439.833333    Project Delta
891          2022      453.083333     Project Zeta
892          2022      613.666667    Project Alpha
893          2024      458.333333    Project Gamma
894          2024      458.333333    Project Gamma

[895 rows x 21 columns]

In [54]:
# 47. Perform a left join with a dataset containing Department and Team Lead details, adding Team Lead to the DataFrame. 
team_lead_df = pd.DataFrame({
    'Department': ['Sales','IT', 'HR'],
    'Team Lead': ['Chad Nichols', 'Amber Harris', 'Cory Escobar']    
})
print(team_lead_df)
merged_df = pd.merge(df, team_lead_df, on ='Department', how = 'inner')
print(merged_df)

  Department     Team Lead
0      Sales  Chad Nichols
1         IT  Amber Harris
2         HR  Cory Escobar
       ID                Name  Age  Gender Department  Salary Joining Date  \
0       1        Cory Escobar   48  Female         HR    5641   2015-05-03
1       2     Timothy Sanchez   25   Other      Sales    4249   2020-11-09
2       3        Chad Nichols   57   Other      Sales    3058   2019-02-12
3       4  Christine Williams   58  Female         IT    5895   2017-09-08
4       5        Amber Harris   35   Other         IT    4317   2020-02-15
..    ...                 ...  ...     ...        ...     ...          ...
890   998     Michael Sanchez   18    Male      Sales    5278   2023-07-05
891   999       Ashley Taylor   51  Female         IT    5437   2022-02-18
892  1000         Shawn Scott   45    Male         IT    7364   2022-07-31
893  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11
894  1001       Nicole Otieno   28  Female         IT    5500   2024-12-11

     Performance Score  Experience   Status  ... Years With Company  Bonus  \
0             2.000000          16   Active  ...                  9  564.1
1             2.000000          11  Retired  ...                  4  424.9
2             3.443615           2  Retired  ...                  5  305.8
3             2.000000          13  Retired  ...                  7  589.5
4             5.000000          16  Retired  ...                  4  431.7
..                 ...         ...      ...  ...                ...    ...
890           5.000000           3   Active  ...                  1  527.8
891           4.000000           9  Retired  ...                  2  543.7
892           2.000000           4   Active  ...                  2  736.4
893           4.500000           3   Active  ...                  1  550.0
894           4.500000           3   Active  ...                  1  550.0

     Normalized Salary  Experience Level    Age Group Session Salary Rank  \
0             0.454500            Senior       Senior     NaN       164.0
1             0.280020            Senior        Young     NaN       201.0
2             0.130735            Junior       Senior     NaN       252.0
3             0.486337            Senior       Senior     NaN       148.0
4             0.288543            Senior  Middle-aged     NaN       209.0
..                 ...               ...          ...     ...         ...
890           0.409000            Junior        Young     NaN       159.0
891           0.428930               Mid       Senior     NaN       167.0
892           0.670469            Junior       Senior     NaN       108.0
893                NaN            Junior        Young     NaN       161.0
894                NaN            Junior          NaN   Night       161.0

     Joining Year  Monthly Salary     Team Lead
0            2015      470.083333  Cory Escobar
1            2020      354.083333  Chad Nichols
2            2019      254.833333  Chad Nichols
3            2017      491.250000  Amber Harris
4            2020      359.750000  Amber Harris
..            ...             ...           ...
890          2023      439.833333  Chad Nichols
891          2022      453.083333  Amber Harris
892          2022      613.666667  Amber Harris
893          2024      458.333333  Amber Harris
894          2024      458.333333  Amber Harris

[895 rows x 21 columns]

In [55]:
# 48.  Create a DataFrame with employee ID and Project Count, then merge it with the original dataset. Calculate the average Salary per project.
def project_count(id):
    if id % 2 == 0:
       return 2;
    elif id % 5 == 0:
       return 3;
    elif id % 3 == 0:
       return 1;
    elif id % 7 == 0:
       return 4;
    else:
       return 5;

project_count_df = pd.DataFrame({
    'ID': range(1, 1002),
    'Recent Projects': [project_count(id) for id in range(1, 1002)]
})
print(project_count_df)

merged_df = pd.merge(df,project_count_df , on = 'ID' , how ='inner')
merged_df

        ID  Recent Projects
0        1                5
1        2                2
2        3                1
3        4                2
4        5                3
...    ...              ...
996    997                5
997    998                2
998    999                1
999   1000                2
1000  1001                4

[1001 rows x 2 columns]

,ID,Name,Age,Gender,Department,Salary,Joining Date,Performance Score,Experience,Status,...,Years With Company,Bonus,Normalized Salary,Experience Level,Age Group,Session,Salary Rank,Joining Year,Monthly Salary,Recent Projects
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.000000,16,Active,...,9,564.1,0.454500,Senior,Senior,NaN,164.0,2015,470.083333,5
1,2,Timothy Sanchez,25,Other,Sales,4249,2020-11-09,2.000000,11,Retired,...,4,424.9,0.280020,Senior,Young,NaN,201.0,2020,354.083333,2
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,3.443615,2,Retired,...,5,305.8,0.130735,Junior,Senior,NaN,252.0,2019,254.833333,1
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.000000,13,Retired,...,7,589.5,0.486337,Senior,Senior,NaN,148.0,2017,491.250000,2
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.000000,16,Retired,...,4,431.7,0.288543,Senior,Middle-aged,NaN,209.0,2020,359.750000,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
890,998,Michael Sanchez,18,Male,Sales,5278,2023-07-05,5.000000,3,Active,...,1,527.8,0.409000,Junior,Young,NaN,159.0,2023,439.833333,2
891,999,Ashley Taylor,51,Female,IT,5437,2022-02-18,4.000000,9,Retired,...,2,543.7,0.428930,Mid,Senior,NaN,167.0,2022,453.083333,1
892,1000,Shawn Scott,45,Male,IT,7364,2022-07-31,2.000000,4,Active,...,2,736.4,0.670469,Junior,Senior,NaN,108.0,2022,613.666667,2
893,1001,Nicole Otieno,28,Female,IT,5500,2024-12-11,4.500000,3,Active,...,1,550.0,NaN,Junior,Young,NaN,161.0,2024,458.333333,4
894,1001,Nicole Otieno,28,Female,IT,5500,2024-12-11,4.500000,3,Active,...,1,550.0,NaN,Junior,NaN,Night,161.0,2024,458.333333,4

In [56]:
# 49. Calculate the percentage increase in Salary for each employee compared to the average Salary in their Department.
df['Percentage Increase in Salary'] = df.groupby('Department')['Salary'].transform(lambda x: ((x - x.mean()) / x.mean()) * 100)
#df = df.drop(columns=['Average Dept Salary'])
#df = df.drop(index=894)
df

,ID,Name,Age,Gender,Department,Salary,Joining Date,Performance Score,Experience,Status,...,Years With Company,Bonus,Normalized Salary,Experience Level,Age Group,Session,Salary Rank,Joining Year,Monthly Salary,Percentage Increase in Salary
0,1,Cory Escobar,48,Female,HR,5641,2015-05-03,2.000000,16,Active,...,9,564.1,0.454500,Senior,Senior,NaN,164.0,2015,470.083333,-5.667816
1,2,Timothy Sanchez,25,Other,Sales,4249,2020-11-09,2.000000,11,Retired,...,4,424.9,0.280020,Senior,Young,NaN,201.0,2020,354.083333,-27.001758
2,3,Chad Nichols,57,Other,Sales,3058,2019-02-12,3.443615,2,Retired,...,5,305.8,0.130735,Junior,Senior,NaN,252.0,2019,254.833333,-47.463256
3,4,Christine Williams,58,Female,IT,5895,2017-09-08,2.000000,13,Retired,...,7,589.5,0.486337,Senior,Senior,NaN,148.0,2017,491.250000,-1.260685
4,5,Amber Harris,35,Other,IT,4317,2020-02-15,5.000000,16,Retired,...,4,431.7,0.288543,Senior,Middle-aged,NaN,209.0,2020,359.750000,-27.691667
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
890,998,Michael Sanchez,18,Male,Sales,5278,2023-07-05,5.000000,3,Active,...,1,527.8,0.409000,Junior,Young,NaN,159.0,2023,439.833333,-9.323436
891,999,Ashley Taylor,51,Female,IT,5437,2022-02-18,4.000000,9,Retired,...,2,543.7,0.428930,Mid,Senior,NaN,167.0,2022,453.083333,-8.932034
892,1000,Shawn Scott,45,Male,IT,7364,2022-07-31,2.000000,4,Active,...,2,736.4,0.670469,Junior,Senior,NaN,108.0,2022,613.666667,23.344583
893,1001,Nicole Otieno,28,Female,IT,5500,2024-12-11,4.500000,3,Active,...,1,550.0,NaN,Junior,Young,NaN,161.0,2024,458.333333,-7.876805
894,1001,Nicole Otieno,28,Female,IT,5500,2024-12-11,4.500000,3,Active,...,1,550.0,NaN,Junior,NaN,Night,161.0,2024,458.333333,-7.876805

In [57]:
# 50.  Print Thanks
print('Thanks')

Thanks